# Parameters
nc: 2  # number of classes
scales:
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
# LSM-YOLO backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, RFAConv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, RFAConv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, MSFM, [128, True]]
  - [-1, 1, LAE, []]  # 3-P3/8
  - [-1, 6, MSFM, [256, True]]
  - [-1, 1, LAE, []]  # 5-P4/16
  - [-1, 6, MSFM, [512, True]]
  - [-1, 1, LAE, []]  # 7-P5/32
  - [-1, 3, MSFM, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

# LSM-YOLO head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, MSFM, [512]]  # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, MSFM, [256]]  # 15 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, Concat, [1]]  # cat backbone P2
  - [-1, 3, MSFM, [128]]  # 18 (P2/4-xsmall)

  - [-1, 1, LAE, []]
  - [[-1, 15], 1, Concat, [1]]  # cat head P3
  - [-1, 3, MSFM, [256]]  # 21 (P3/8-small)

  - [-1, 1, LAE, []]
  - [[-1, 12], 1, Concat, [1]]  # cat head P4
  - [-1, 3, MSFM, [512]]  # 18 (P4/16-medium)

  - [-1, 1, LAE, []]
  - [[-1, 9], 1, Concat, [1]]  # cat head P5
  - [-1, 3, MSFM, [1024]]  # 21 (P5/32-large)

  - [[18, 21, 24, 27], 1, Detect, [nc]]  # Detect(P3, P4, P5)
